In [220]:
import sqlite3
import pandas as pd
import os

data = 'Reto_Dos.db'
os.path.join(os.getcwd(),data )

'c:\\Users\\USER\\Documents\\XalDigital\\Reto_Dos.db'

Conectar con la BD

In [221]:
path = os.path.join(os.getcwd(),data )
sqliteConnection = sqlite3.Connection(path)
cursor = sqliteConnection.cursor()

In [222]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall( ))

[('aerolineas',), ('aeropuertos',), ('movimientos',), ('vuelos',)]

1. ¿Cuál es el nombre aeropuerto que ha tenido mayor movimiento durante el año?

In [223]:
query = 'SELECT MAX(MOVIMIENTOS) as MOVIMIENTOS, NOMBRE_AEROPUERTO from (SELECT count(*) as MOVIMIENTOS, NOMBRE_AEROPUERTO FROM vuelos v LEFT JOIN aeropuertos a ON v.ID_AEROPUERTO = a.ID_AEROPUERTO GROUP BY NOMBRE_AEROPUERTO);'
pd.read_sql_query(query, sqliteConnection).head(1)

   MOVIMIENTOS NOMBRE_AEROPUERTO
0            3     Benito Juarez

2. ¿Cuál es el nombre aerolínea que ha realizado mayor número de vuelos durante el año?

In [224]:
query1 = 'SELECT MAX(VUELOS) as VUELOS, NOMBRE_AEROLINEA from (SELECT count(*) as VUELOS, NOMBRE_AEROLINEA FROM vuelos v LEFT JOIN aerolineas a ON v.ID_AEROLINEA = a.ID_AEROLINEA GROUP BY NOMBRE_AEROLINEA);'
pd.read_sql_query(query1, sqliteConnection).head(1)

   VUELOS NOMBRE_AEROLINEA
0       3          Aeromar

3. ¿En qué día se han tenido mayor número de vuelos?

In [225]:
query2 = 'SELECT count(DIA) as VUELOS, DIA FROM vuelos GROUP BY DIA;'
pd.read_sql_query(query2, sqliteConnection).head(5)

   VUELOS         dia
0       6  2021-05-02
1       3  2021-05-04

4. ¿Cuáles son las aerolíneas que tienen mas de 2 vuelos por día?

In [226]:
query3 = 'SELECT count(*) as VUELOS, NOMBRE_AEROLINEA FROM vuelos v LEFT JOIN aerolineas a ON v.ID_AEROLINEA = a.ID_AEROLINEA GROUP BY NOMBRE_AEROLINEA;'
pd.read_sql_query(query3, sqliteConnection).head(5)

   VUELOS nombre_aerolinea
0       3          Aeromar
1       1       Aeromexico
2       3         Interjet
3       2          Volaris

In [227]:
cursor.close()

sqliteConnection.close()